#include <stdio.h>
#include <stdlib.h>
#include <time.h>

void checkScore(int score) {
  printf("\n"); printf("\n");
  printf("♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬"); 
  printf("♬                             _________________현재 여러분의 점수입니다.__________________                           ♬"); 
  printf("♬                                                                                                                    ♬"); 
  printf("♬                            ______________________점수 : %d 점___________________________                            ♬",score); 
  printf("♬                                                                                                                    ♬"); 
  printf("♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬");
  printf("\n");

}

void checkScore(int mScore, int cScore) { 
  printf("♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬"); 
  printf("♬                             _________________현재 여러분의 점수입니다.__________________                           ♬"); 
  printf("♬                                                                                                                    ♬"); 
  printf("♬                             ______________________점수 : %d 점___________________________                          ♬",mScore); 
  printf("♬                                                                                                                    ♬"); 
  printf("♬                             ____________________컴퓨터의 점수입니다._____________________                          ♬"); 
  printf("♬                                                                                                                    ♬");
  printf("♬                            ______________________점수 : %d 점___________________________                            ♬",cScore);
  printf("♬                                                                                                                    ♬");
  printf("♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬♬");
  printf("\n");

}

int main() {
  int diceCount = 0;
  int mScore = 0;
  int cScore = 0;
  int selection=0,sel=0, check; 
  int i, number_1,number_2, number_3, mine, ans,score=0;
  int answer, stop=0,con;
  int d;
  srand(time(NULL));
  while(stop<10){  
  printf("□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□");
  printf("□                                                                                                                    □");
  printf("□     <<< 기초를  다지고 싶다면 ①, 총점을 확인하고 싶다면 ②, 수학에 재미를 느끼고 싶다면 ③을 눌러주세요.>>>       □");
  printf("□      _____________________________________________________________________________________________________         □");
  printf("□                                                                                                                    □");
  printf("□      _______<<<<  MATH 테마파크에 오신 여러분, 진심으로 환영합니다.>>>>__ 나가시는 문은 ④입니다__________         □");
  printf("□                                                                                                                    □");
  printf("□      ___________<<< 놀이기구를 타고 난 후 얻은 점수가 -이면 퇴장이 된다는 사실을 명심하십시오.>>>_________         □");
  printf("□                                                                                                                    □");
  printf("□      __________________________<<< ③은 1번만 갈 수 있다는 사실을 명심하십시오. .>>>______________________         □");
  printf("□                                                                                                                    □");
  printf("□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□□");
  printf("\n");

 
   printf("\n"); printf(" |       ① 간단 연산 파크    |     ② 수학 실력 검증 파크    |     ③ 던져라~ 주사위! 파크    |     ④ 나가시는 문    |"); printf("\n");  printf("\n");
   printf("들어가실 문 번호를 선택해주세요  : "); 
  	scanf("%d", &selection);
    
    if(selection == 1) { printf("\n"); printf("\n");
        
    	 printf("☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆");
    	 printf("☆                                                                                                                    ☆");
    	 printf("☆                           <<<<  간단 연산 파크에 오신 여러분, 진심으로 환영합니다.>>>>                             ☆");
    	 printf("☆      _____________________________________________________________________________________________________         ☆");
    	 printf("☆            <<< 사칙 연산 놀이기구는 ① , 도형  놀이기구는  ②, 함수 놀이기구는  ③을 눌러주세요.>>>                ☆");
    	 printf("☆      _____________________________________________________________________________________________________         ☆");
    	 printf("☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆");  printf("\n");
    	 printf("들어가실 문 번호를 선택해주세요  : ");
    	 scanf("%d",&check);
    	 if(check==1){
    	 	printf("\n"); printf("\n");
    	 	printf("☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆");
    	    printf("☆                                                                                                                    ☆");
    	    printf("☆                         <<<<  사칙 연산 놀이기구에 오신 여러분, 진심으로 환영합니다.>>>>                           ☆");
    	    printf("☆      _____________________________________________________________________________________________________         ☆");
    	    printf("☆                           <<< 성공하면 +1 , 실패하면 -1점입니다. 몇 번 타시겠습니까?>>>                            ☆");
    	    printf("☆      _____________________________________________________________________________________________________         ☆");
    	    printf("☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆"); printf("\n");
    	    printf("타고 싶은 횟수를 입력해주세요  : ");
    	 	scanf("%d",&number_1); 
    	 	for(i=0; i<number_1; i++)
    	 	{
    	 		int m = (rand() % 30) + 1;
                int n = (rand() % 10) + 1;
                
    	 		printf("\n"); printf("%d * %d =  ", m,n);
    	 		scanf("%d",&mine);
    	 		ans= m*n;
    	 		 if(mine==ans){
    	 			score=score+1;
    	 			printf("\n"); printf("1점 획득하셨습니다~!\n\n");
				 }
				 else{
					score=score-1;
				    printf("\n"); printf("1점 잃으셨습니다~!\n\n");
				}
			 }
    	 	printf("축하합니다~! 얻은 총점은 %d 점입니다~!\n", score); printf("\n");
    	 	
    	 	if(score<0)
			 {
			 	printf("얻은 점수가 - 이므로 강제퇴장당하셨습니다.\n");
			 	stop=10;
			  } 
			else{
				continue;
			}
    	 	
		 }
		 else if(check==2){
		 	printf("\n"); printf("\n");
    	 	printf("☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆");
    	    printf("☆                                                                                                                    ☆");
    	    printf("☆                            <<<<  도형  놀이기구에 오신 여러분, 진심으로 환영합니다.>>>>                            ☆");
    	    printf("☆      _____________________________________________________________________________________________________         ☆");
    	    printf("☆                       <<< 성공하면 +10 , 실패하면 -10점입니다. 기회는 단 한번뿐입니다.>>>                          ☆");
    	    printf("☆      _____________________________________________________________________________________________________         ☆");
    	    printf("☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆"); printf("\n");
    	    printf("1부터 5까지의 숫자 중 하나를 선택해주세요  : ");
    	    scanf("%d",&number_2); printf("\n");
    	    
    	 	 if(number_2==1){
    	 	 	printf("'등변사다리꼴: 한 밑변의 양 끝각의 크기가 같은 사다리꼴이다'\n"); printf("\n");
    	 	 	printf("다음 물음에 맞다면 0 (숫자 영) 틀리면 1 (숫자 일) 을  입력해주세요 : ");
    	 	 	scanf("%d",&d); printf("\n");
    	 	 	 if(d==0){
    	 	 	 	score=score+10;
    	 	 	 	printf("축하합니다~! 얻은 총점은 10 점입니다~!\n"); printf("\n");
				   }
				 else{
				 	score=score-10;
				 	printf("축하합니다~! 얻은 총점은 - 10 점입니다~!\n"); printf("\n");
				 }
			  }
			  
			 else if(number_2==2){
			 	printf("'평행사변형: 두 쌍의 대변이 각각 평행인 사각형이다'\n"); printf("\n");
			 	printf("다음 물음에 맞다면 0 (숫자 영) 틀리면 1 (숫자 일) 을  입력해주세요 : ");
    	 	 	scanf("%d",&d); printf("\n");
    	 	 	 if(d==0){
    	 	 	 	score=score+10;
    	 	 	 	printf("축하합니다~! 얻은 총점은 10 점입니다~!\n"); printf("\n");
				   }
				 else{
				 	score=score-10;
				 	printf("축하합니다~! 얻은 총점은 - 10 점입니다~!\n"); printf("\n");
				 }
			  }
			  
			 else if(number_2==3){
			 	printf("'직사각형 : 네 변의 길이가 모두 같은 사각형이다'\n"); printf("\n");
			 	printf("다음 물음에 맞다면 0 (숫자 영) 틀리면 1 (숫자 일) 을  입력해주세요 : ");
    	 	 	scanf("%d",&d); printf("\n");
    	 	 	 if(d==1){
    	 	 	 	score=score+10;
    	 	 	 	printf("축하합니다~! 얻은 총점은 10 점입니다~!\n"); printf("\n");
				   }
				 else{
				 	score=score-10;
				 	printf("축하합니다~! 얻은 총점은 - 10 점입니다~!\n"); printf("\n");
				 }
			  }
			  
			  else if(number_2==4){
			 	printf("'마름모 : 네 각의 크기가 모두 같은 사각형이다'\n"); printf("\n");
			 	printf("다음 물음에 맞다면 0 (숫자 영) 틀리면 1 (숫자 일) 을  입력해주세요 : ");
    	 	 	scanf("%d",&d); printf("\n");
    	 	 	 if(d==1){
    	 	 	 	score=score+10;
    	 	 	 	printf("축하합니다~! 얻은 총점은 10 점입니다~!\n"); printf("\n");
				   }
				 else{
				 	score=score-10;
				 	printf("축하합니다~! 얻은 총점은 - 10 점입니다~!\n"); printf("\n");
				 }
			  }
			  
			  else if(number_2==5){
			 	printf("'정사각형: 네 내각의 크기와 네 변의 길이가 모두 같은 사각형이다'\n"); printf("\n");
			 	printf("다음 물음에 맞다면 0 (숫자 영) 틀리면 1 (숫자 일) 을  입력해주세요 : ");
    	 	 	scanf("%d",&d); printf("\n");
    	 	 	 if(d==0){
    	 	 	 	score=score+10;
    	 	 	 	printf("축하합니다~! 얻은 총점은 10 점입니다~!\n"); printf("\n");
				   }
				 else{
				 	score=score-10;
				 	printf("축하합니다~! 얻은 총점은 - 10 점입니다~!\n"); printf("\n");
				 }
			  }
    	  if(score<0)
			 {
			 	printf("얻은 점수가 - 이므로 강제퇴장당하셨습니다.\n");
			 	stop=1;
			  } 
		  else if(score>=0){
				continue;
			}
		 }
		  else if(check==3){
		 	printf("\n"); printf("\n");
    	 	printf("☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆");
    	    printf("☆                                                                                                                    ☆");
    	    printf("☆                            <<<<  함수  놀이기구에 오신 여러분, 진심으로 환영합니다.>>>>                            ☆");
    	    printf("☆      _____________________________________________________________________________________________________         ☆");
    	    printf("☆                       <<< 성공하면 +10 , 실패하면 -10점입니다. 기회는 단 한번뿐입니다.>>>                          ☆");
    	    printf("☆      _____________________________________________________________________________________________________         ☆");
    	    printf("☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆"); printf("\n");
    	    printf("1부터 5까지의 숫자 중 하나를 선택해주세요  : ");
    	    scanf("%d",&number_3); printf("\n");
    	    
    	 	 if(number_3==1){
    	 	 	printf("'y = sinx ⇒ y′ = cosx 이다'\n"); printf("\n");
    	 	 	printf("다음 물음에 맞다면 0 (숫자 영) 틀리면 1 (숫자 일) 을  입력해주세요 : ");
    	 	 	scanf("%d",&d); printf("\n");
    	 	 	 if(d==0){
    	 	 	 	score=score+10;
    	 	 	 	printf("축하합니다~! 얻은 총점은 10 점입니다~!\n"); printf("\n");
				   }
				 else{
				 	score=score-10;
				 	printf("축하합니다~! 얻은 총점은 - 10 점입니다~!\n"); printf("\n");
				 }
			  }
			  
			 else if(number_3==2){
			 	printf("'y = tanx ⇒ y′ = sec2x이다'\n"); printf("\n");
			 	printf("다음 물음에 맞다면 0 (숫자 영) 틀리면 1 (숫자 일) 을  입력해주세요 : ");
    	 	 	scanf("%d",&d); printf("\n");
    	 	 	 if(d==0){
    	 	 	 	score=score+10;
    	 	 	 	printf("축하합니다~! 얻은 총점은 10 점입니다~!\n"); printf("\n");
				   }
				 else{
				 	score=score-10;
				 	printf("축하합니다~! 얻은 총점은 - 10 점입니다~!\n"); printf("\n");
				 }
			  }
			  
			 else if(number_3==3){
			 	printf("'y = cotx ⇒ y′ = cosec2x이다'\n"); printf("\n");
			 	printf("다음 물음에 맞다면 0 (숫자 영) 틀리면 1 (숫자 일) 을  입력해주세요 : ");
    	 	 	scanf("%d",&d); printf("\n");
    	 	 	 if(d==1){
    	 	 	 	score=score+10;
    	 	 	 	printf("축하합니다~! 얻은 총점은 10 점입니다~!\n"); printf("\n");
				   }
				 else{
				 	score=score-10;
				 	printf("축하합니다~! 얻은 총점은 - 10 점입니다~!\n"); printf("\n");
				 }
			  }
			  
			  else if(number_3==4){
			 	printf("'y = cosx ⇒ y′ = -sinx이다'\n"); printf("\n");
			 	printf("다음 물음에 맞다면 0 (숫자 영) 틀리면 1 (숫자 일) 을  입력해주세요 : ");
    	 	 	scanf("%d",&d); printf("\n");
    	 	 	 if(d==1){
    	 	 	 	score=score+10;
    	 	 	 	printf("축하합니다~! 얻은 총점은 10 점입니다~!\n"); printf("\n");
				   }
				 else{
				 	score=score-10;
				 	printf("축하합니다~! 얻은 총점은 - 10 점입니다~!\n"); printf("\n");
				 }
			  }
			  
			  else if(number_3==5){
			 	printf("'y = secx ⇒ y′ = secx tanx이다'\n"); printf("\n");
			 	printf("다음 물음에 맞다면 0 (숫자 영) 틀리면 1 (숫자 일) 을  입력해주세요 : ");
    	 	 	scanf("%d",&d); printf("\n");
    	 	 	 if(d==0){
    	 	 	 	score=score+10;
    	 	 	 	printf("축하합니다~! 얻은 총점은 10 점입니다~!\n"); printf("\n");
				   }
				 else{
				 	score=score-10;
				 	printf("축하합니다~! 얻은 총점은 - 10 점입니다~!\n"); printf("\n");
				 }
			  }
    	 	if(score<0)
			 {
			 	printf("얻은 점수가 - 이므로 강제퇴장당하셨습니다.\n");
			 	stop=1;
			  } 
			  
		  else if(score>=0){
				continue;
		 }
    	 
      
    } 
	else if(selection == 2) {
		printf("\n"); printf("\n");
		printf("♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧");
		printf("♧                                                                                                                    ♧");
    	printf("♧                      <<<< 수학 실력 검증 파크에 오신 여러분, 진심으로 환영합니다.>>>>                              ♧");
    	printf("♧      _____________________________________________________________________________________________________         ♧");
    	printf("♧                                                                                                                    ♧");
    	printf("♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧♧"); 
    	
      checkScore(score); printf("\n"); printf("\n");
      
      continue;
    } 
    
    
    else if(selection==3) {
    	printf("\n"); printf("\n");
        printf("♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡");
		printf("♡                                                                                                                    ♡");
    	printf("♡                        <<<< 던져라~ 주사위! 파크에 오신 여러분, 진심으로 환영합니다.>>>>                           ♡");
    	printf("♡      _____________________________________________________________________________________________________         ♡");
    	printf("♡                                                                                                                    ♡");
    	printf("♡                 <<< 주사위를 4번 던졌을 때 총합이 컴퓨터보다 높으면 점수가 2배가 됩니다. .>>>                      ♡");
    	printf("♡      _____________________________________________________________________________________________________         ♡");  
    	printf("♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡"); 
		
		while(diceCount < 4) {
   	     printf("\n주사위를 굴려주세요. 주사위 굴리기는 1번, 현재 눈의 합 확인하기는 2번을 눌러주세요 : ");
  	     scanf("%d", &sel); printf("\n");
    
    if(sel == 1) {
      int mResult = (rand() % 6) + 1;
      int cResult = (rand() % 6) + 1;
      
      mScore += mResult;
      cScore += cResult;
      
      printf("\n플레이어의 차례입니다. 주사위를 굴립니다."); printf("\n"); printf("\n");
      printf("\n띠링! 주사위의 눈은 %d 입니다.", mResult); printf("\n"); printf("\n");
      printf("\n현재 총 점수는 %d 입니다.", mScore); printf("\n"); printf("\n");
      
      printf("\n컴퓨터의 차례입니다. 주사위를 굴립니다."); printf("\n"); printf("\n");
      printf("\n띠링! 주사위의 눈은 %d 입니다.", cResult); printf("\n"); printf("\n");
      printf("\n현재 총 점수는 %d 입니다.", cScore); printf("\n"); printf("\n");
      
	  diceCount++;
	  if(diceCount==3){
	  	if(mScore>cScore){
	  		printf("축하합니다~! 점수가 2배가 되었습니다!\n");
	  		score=score*2;
	  		con=10; 
		  }
		else{
			printf("아쉽게도 점수는 그대로 입니다.\n");
			con=10;
		}
	  }
    } 
    
	else if(sel == 2) {
      checkScore(mScore, cScore); printf("\n"); printf("\n");
    } 
    
	else {
      printf("\n잘못 입력하셨습니다."); printf("\n"); printf("\n");
      continue;
    }
  }
  
  if(con=10){
  	continue;
  }
  
  
  return 0;
}

    
    else if(selection==4){
    	stop=1;
	}
    else{
      printf("\n잘못 입력하셨습니다.");
    }
  
  
  return 0;
};
}
}

